In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt 
%matplotlib inline
import numpy as np
print(pd.__version__)
print(sns.__version__)
print(np.__version__)

1.4.4
0.12.0
1.23.2

### 데이터 가져오기

In [2]:
df=pd.read_csv("MetroData/22년 1월.csv")
df2=pd.read_csv("MetroData/22년 2월.csv")
df3=pd.read_csv("MetroData/22년 3월.csv")
df4=pd.read_csv("MetroData/22년 4월.csv")
df5=pd.read_csv("MetroData/22년 5월.csv")
df6=pd.read_csv("MetroData/22년 6월.csv")
df7=pd.read_csv("MetroData/22년 7월.csv")
df8=pd.read_csv("MetroData/22년 8월.csv")

### 데이터 확인

In [3]:
df.head()

        사용일  노선명   역명  승차승객  하차승객
0  20220101  3호선   수서  7370  7076
1  20220101  3호선  학여울   461   473
2  20220101  3호선   대청  3224  2903
3  20220101  3호선   일원  3321  2803
4  20220101  경원선   창동     1     0

In [4]:
df2.tail()

            사용일  노선명    역명   승차승객   하차승객
16707  20220228  중앙선    회기  21942  21477
16708  20220228  2호선    당산  15750  18370
16709  20220228  2호선    합정  26415  27830
16710  20220228  2호선  홍대입구  48847  50982
16711  20220228  2호선    신촌  29728  30184

In [5]:
df3.sample(5)

            사용일  노선명        역명   승차승객   하차승객
7494   20220313  6호선  월곡(동덕여대)   4227   4028
11783  20220320  5호선        마곡   3109   3275
9721   20220317  5호선  광나루(장신대)  11959  11059
14671  20220325  7호선      건대입구  11965  12738
14226  20220324  경인선        송내  24860  24603

In [6]:
df4.sample(5)

            사용일  노선명              역명   승차승객   하차승객
12404  20220421  2호선           을지로입구  38929  35764
14124  20220424  안산선             대야미   3601   3070
14387  20220425  4호선  동대문역사문화공원(DDP)  13639  12519
5245   20220409  안산선              고잔   6770   6735
14373  20220425  3호선              오금   6535   5889

In [7]:
df5.sample(5)

           사용일  노선명    역명   승차승객   하차승객
6990  20220512  6호선    보문   8084   7356
8241  20220514  경부선    평택  16208  15537
4062  20220507  분당선    모란  15941  16181
9196  20220516  8호선    장지  17686  16889
8108  20220514  7호선  태릉입구   9919   9694

In [8]:
df6.sample(5)

            사용일  노선명         역명   승차승객   하차승객
12736  20220622  분당선        개포동   4427   4541
14144  20220624  6호선  안암(고대병원앞)  12395  11937
3285   20220606  7호선         반포   3374   3231
4806   20220608  경의선         금릉   5541   5417
6194   20220611  5호선        서대문   8220   8008

In [9]:
df7.sample(5)

            사용일       노선명    역명   승차승객   하차승객
11845  20220720  9호선2~3단계   선정릉  10936  12165
6778   20220712       경의선    파주   1275    806
11574  20220720       장항선    봉명   1424   1369
10823  20220718       수인선    달월    130     96
8614   20220715       8호선  강동구청  11431  11583

In [10]:
df8.sample(5)

            사용일  노선명     역명   승차승객   하차승객
1924   20220804  경강선  세종대왕릉    358    373
18397  20220831  7호선     노원  20456  21575
389    20220801  5호선     강일   3811   4293
1657   20220803  경춘선    대성리    735    797
4134   20220807  분당선     태평   7635   7463

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18521 entries, 0 to 18520
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사용일     18521 non-null  int64
 1   노선명     18521 non-null  object
 2   역명      18521 non-null  object
 3   승차승객    18521 non-null  int64
 4   하차승객    18521 non-null  int64
dtypes: int64(3), object(2)
memory usage: 723.6+ KB

In [12]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16712 entries, 0 to 16711
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사용일     16712 non-null  int64
 1   노선명     16712 non-null  object
 2   역명      16712 non-null  object
 3   승차승객    16712 non-null  int64
 4   하차승객    16712 non-null  int64
dtypes: int64(3), object(2)
memory usage: 652.9+ KB

In [13]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18467 entries, 0 to 18466
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사용일     18467 non-null  int64
 1   노선명     18467 non-null  object
 2   역명      18467 non-null  object
 3   승차승객    18467 non-null  int64
 4   하차승객    18467 non-null  int64
dtypes: int64(3), object(2)
memory usage: 721.5+ KB

In [14]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17847 entries, 0 to 17846
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사용일     17847 non-null  int64
 1   노선명     17847 non-null  object
 2   역명      17847 non-null  object
 3   승차승객    17847 non-null  int64
 4   하차승객    17847 non-null  int64
dtypes: int64(3), object(2)
memory usage: 697.3+ KB

In [15]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18496 entries, 0 to 18495
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사용일     18496 non-null  int64
 1   노선명     18496 non-null  object
 2   역명      18496 non-null  object
 3   승차승객    18496 non-null  int64
 4   하차승객    18496 non-null  int64
dtypes: int64(3), object(2)
memory usage: 722.6+ KB

In [16]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18179 entries, 0 to 18178
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사용일     18179 non-null  int64
 1   노선명     18179 non-null  object
 2   역명      18179 non-null  object
 3   승차승객    18179 non-null  int64
 4   하차승객    18179 non-null  int64
dtypes: int64(3), object(2)
memory usage: 710.2+ KB

In [17]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18790 entries, 0 to 18789
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사용일     18790 non-null  int64
 1   노선명     18790 non-null  object
 2   역명      18790 non-null  object
 3   승차승객    18790 non-null  int64
 4   하차승객    18790 non-null  int64
dtypes: int64(3), object(2)
memory usage: 734.1+ KB

In [18]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18782 entries, 0 to 18781
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사용일     18782 non-null  int64
 1   노선명     18782 non-null  object
 2   역명      18782 non-null  object
 3   승차승객    18782 non-null  int64
 4   하차승객    18782 non-null  int64
dtypes: int64(3), object(2)
memory usage: 733.8+ KB

### 데이터 속성
 - 사용일 : int
 - 노선명 : object
 - 역명 : object
 - 승차승객 : int
 - 하차승객 : int

### 결측치 확인

In [20]:
df.isna().sum()

사용일     0
노선명     0
역명      0
승차승객    0
하차승객    0
dtype: int64

In [21]:
df2.isna().sum()

사용일     0
노선명     0
역명      0
승차승객    0
하차승객    0
dtype: int64

In [22]:
df3.isna().sum()

사용일     0
노선명     0
역명      0
승차승객    0
하차승객    0
dtype: int64

In [23]:
df4.isna().sum()

사용일     0
노선명     0
역명      0
승차승객    0
하차승객    0
dtype: int64

In [24]:
df5.isna().sum()

사용일     0
노선명     0
역명      0
승차승객    0
하차승객    0
dtype: int64

In [25]:
df6.isna().sum()

사용일     0
노선명     0
역명      0
승차승객    0
하차승객    0
dtype: int64

In [26]:
df7.isna().sum()

사용일     0
노선명     0
역명      0
승차승객    0
하차승객    0
dtype: int64

In [27]:
df8.isna().sum()

사용일     0
노선명     0
역명      0
승차승객    0
하차승객    0
dtype: int64

### 결측치 없음

### 정보 요약

In [28]:
df.describe()

                사용일          승차승객          하차승객
count  1.852100e+04  18521.000000  18521.000000
mean   2.022012e+07   9060.095135   9028.133794
std    8.942121e+00   9538.424818   9607.117182
min    2.022010e+07      1.000000      0.000000
25%    2.022011e+07   2858.000000   2768.000000
50%    2.022012e+07   6240.000000   6120.000000
75%    2.022012e+07  11863.000000  11730.000000
max    2.022013e+07  92932.000000  91167.000000

In [29]:
df2.describe()

                사용일          승차승객          하차승객
count  1.671200e+04  16712.000000  16712.000000
mean   2.022021e+07   8517.294818   8489.189983
std    8.073208e+00   8843.369670   8876.721606
min    2.022020e+07      1.000000      0.000000
25%    2.022021e+07   2722.000000   2633.750000
50%    2.022022e+07   5910.500000   5814.000000
75%    2.022022e+07  11241.250000  11113.750000
max    2.022023e+07  84950.000000  82108.000000

In [30]:
df3.describe()

                사용일          승차승객          하차승객
count  1.846700e+04  18467.000000  18467.000000
mean   2.022032e+07   8851.885688   8822.759463
std    8.944387e+00   8691.106320   8778.915177
min    2.022030e+07      1.000000      0.000000
25%    2.022031e+07   3078.500000   2989.000000
50%    2.022032e+07   6334.000000   6229.000000
75%    2.022032e+07  11838.000000  11742.000000
max    2.022033e+07  80279.000000  78816.000000

In [31]:
df4.describe()

                사용일           승차승객           하차승객
count  1.784700e+04   17847.000000   17847.000000
mean   2.022042e+07   10321.086737   10282.937132
std    8.654078e+00    9958.381957   10131.443573
min    2.022040e+07       1.000000       0.000000
25%    2.022041e+07    3707.000000    3564.500000
50%    2.022042e+07    7511.000000    7291.000000
75%    2.022042e+07   13739.000000   13627.000000
max    2.022043e+07  122543.000000  118237.000000

In [32]:
df5.describe()

                사용일          승차승객          하차승객
count  1.849600e+04  18496.000000  18496.000000
mean   2.022052e+07  10997.577801  10961.165117
std    8.954492e+00  10642.697815  10871.610179
min    2.022050e+07      1.000000      0.000000
25%    2.022051e+07   3938.250000   3763.000000
50%    2.022052e+07   8011.500000   7710.000000
75%    2.022052e+07  14611.500000  14483.000000
max    2.022053e+07  97288.000000  98286.000000

In [33]:
df6.describe()

                사용일          승차승객          하차승객
count  1.817900e+04  18179.000000  18179.000000
mean   2.022062e+07  10529.076407  10490.024974
std    8.656050e+00  10392.609820  10574.590772
min    2.022060e+07      1.000000      0.000000
25%    2.022061e+07   3635.500000   3487.000000
50%    2.022062e+07   7621.000000   7345.000000
75%    2.022062e+07  13926.000000  13725.500000
max    2.022063e+07  94875.000000  95390.000000

In [34]:
df7.describe()

                사용일          승차승객          하차승객
count  1.879000e+04  18790.000000  18790.000000
mean   2.022072e+07  10301.967110  10263.144119
std    8.945175e+00  10431.094294  10600.758791
min    2.022070e+07      1.000000      0.000000
25%    2.022071e+07   3509.000000   3369.250000
50%    2.022072e+07   7378.000000   7114.000000
75%    2.022072e+07  13537.750000  13281.000000
max    2.022073e+07  96795.000000  96558.000000

In [35]:
df8.describe()

                사용일          승차승객          하차승객
count  1.878200e+04  18782.000000  18782.000000
mean   2.022082e+07   9926.206474   9889.340113
std    8.944884e+00   9964.206077  10104.228897
min    2.022080e+07      1.000000      0.000000
25%    2.022081e+07   3412.000000   3264.250000
50%    2.022082e+07   7138.000000   6894.000000
75%    2.022082e+07  13027.750000  12845.750000
max    2.022083e+07  89847.000000  88744.000000

### 범주형 컬럼까지 확인

In [36]:
df.describe(include="object")

          노선명     역명
count   18521  18521
unique     25    522
top       5호선    서울역
freq     1736    155

In [37]:
df2.describe(include="object")

          노선명     역명
count   16712  16712
unique     25    522
top       5호선    서울역
freq     1568    140

In [38]:
df3.describe(include="object")

          노선명     역명
count   18467  18467
unique     25    522
top       5호선    서울역
freq     1736    155

In [39]:
df4.describe(include="object")

          노선명     역명
count   17847  17847
unique     25    520
top       5호선    서울역
freq     1680    150

In [40]:
df5.describe(include="object")

          노선명     역명
count   18496  18496
unique     26    525
top       5호선    서울역
freq     1736    155

In [41]:
df6.describe(include="object")

          노선명     역명
count   18179  18179
unique     26    524
top       5호선    서울역
freq     1680    150

In [42]:
df7.describe(include="object")

          노선명     역명
count   18790  18790
unique     26    523
top       5호선    서울역
freq     1736    155

In [43]:
df8.describe(include="object")

          노선명     역명
count   18782  18782
unique     26    526
top       5호선    서울역
freq     1736    155

### 빈도
- 노선 : 5호선 최다
- 역 : 서울역 최다
- 매월 변함없음